FILES/InformationRegisters/ПользовательскиеМакетыПечатиПараметры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПользовательскиеМакетыПечатиПараметры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначеиеПараметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИПечатныеФормы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/ПользовательскиеМакетыПечатиПараметры/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПослеРедактированияЗапроса(Текст, ЭлементДерева) Экспорт
        Если Не ПустаяСтрока(Текст) Тогда
            Запись.ЗапросМакета = Текст;
			Модифицированность = Истина;
        Иначе
            Модифицированность = Ложь;
        КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗапроса(Команда)
	
	Текст = СокрЛП(Запись.ЗапросМакета);
	
	КодПрограммы = "
	|КонструкторЗапроса = Новый КонструкторЗапроса;
	|Если Не ПустаяСтрока(Текст) Тогда
	|		КонструкторЗапроса.Текст = Текст;
	|КонецЕсли;
	|";
		
    #Если ТолстыйКлиентУправляемоеПриложение Тогда
    Попытка
        
        КодПрограммы = КодПрограммы+ "
        |КонструкторЗапроса.АвтоДобавлениеПредставлений = ТекущиеДанные.АвтоДобавлениеПредставлений;
        |КонструкторЗапроса.РежимКомпоновкиДанных        = ТекущиеДанные.РежимКомпоновкиДанных;
        |
        |Если КонструкторЗапроса.ОткрытьМодально() Тогда
        |    ТекущиеДанные.Текст = КонструкторЗапроса.Текст;
        |    ПроверитьТекстЗапроса_ПолучитьПараметры_ОбновитьДанные();
        |КонецЕсли;
        |";
        Выполнить(КодПрограммы);
    Исключение
        Сообщить(ОписаниеОшибки());
    КонецПопытки;
    
    #Иначе
        
    Попытка
		
		КодПрограммы = КодПрограммы+ "
		|КонструкторЗапроса.Показать(Новый ОписаниеОповещения(""ПослеРедактированияЗапроса"", ЭтаФорма, Неопределено));
		|";
		Выполнить(КодПрограммы);
   Исключение
        Сообщить(ОписаниеОшибки());
    КонецПопытки;
	#КонецЕсли

КонецПроцедуры



&НаСервере
Процедура ОбъектПриИзмененииНаСервере()
	// Получим все макеты и заполним список макетов.
	Если Запись.Объект <> Справочники.ДополнительныеОтчетыИПечатныеФормы.ПустаяСсылка() Тогда
		ВОбработка = ВернутьОбработкуНаСервере();
		
		СведенияОПФ = ВОбработка.СведенияОВнешнейОбработке();
		ЭтаФорма.Элементы.ИмяМакета.СписокВыбора.Очистить();
		Для Каждого МакетВО ИЗ ВОбработка.Метаданные().Макеты Цикл
			ЭтаФорма.Элементы.ИмяМакета.СписокВыбора.Добавить(СведенияОПФ.Идентификатор+"."+МакетВО.Имя, СведенияОПФ.Идентификатор+"."+МакетВО.Имя);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	ОбъектПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ВернутьОбработкуНаСервере()
	
	ВОбработка = ДополнительныеОтчетыИПечатныеФормыВызовСервер.ВернутьОбработкуПоСсылке(Запись.Объект);
	Возврат ВОбработка;
	
КонецФункции



&НаСервере
Процедура ИмяМакетаПриИзмененииНаСервере()
	
	Если Запись.Объект <> Справочники.ДополнительныеОтчетыИПечатныеФормы.ПустаяСсылка() Тогда
		ВОбработка = ВернутьОбработкуНаСервере();
		ИмяМакетаОбработки = СтрРазделить(Запись.ИмяМакета, ".")[1];
		ЭтаФорма.Элементы.Параметр.СписокВыбора.Очистить();
		
		Попытка
			ПараметрыПечатныхФорм = ВОбработка.ПолучитьПараметрыПечатныхФорм();
			
			ЭтаФорма.ПараметрыПечатныхФормСтрока = УправлениеБТВызовСервера.ВJSON(ПараметрыПечатныхФорм);

			ПараметрыМакета = Новый Соответствие();
			Если ПараметрыПечатныхФорм.Свойство(ИмяМакетаОбработки,ПараметрыМакета) Тогда
				Для Каждого ПараметрМакета ИЗ ПараметрыМакета Цикл
					ЭтаФорма.Элементы.Параметр.СписокВыбора.Добавить(ПараметрМакета.Ключ, ПараметрМакета.Ключ);
				КонецЦикла;
				
			КонецЕсли;
		Исключение
			//Нет параметров у печатной формы
			Сообщить("У данного макета нет параметров");
		КонецПопытки;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ИмяМакетаПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяМакетаПриИзменении(Элемент)
	
	ИмяМакетаПриИзмененииНаСервере();
	//Режим = РежимДиалогаВопрос.ДаНет;
	//Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
	//ПоказатьВопрос(Оповещение, "Обновить параметры печатной формы?", Режим, 0);
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьЗапросНаСервере()
	ВОбработка = ВернутьОбработкуНаСервере();
	
	Попытка
		Запись.ЗапросМакета = ВОбработка.ПолучитьТекстЗапроса();
	Исключение
	КонецПопытки;
	ВидимостьНаФормеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьЗапрос(Команда)
	ПеречитатьЗапросНаСервере();
КонецПроцедуры



&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//ХЗ = Новый ХранилищеЗначения(ТабличныйДокумент, Новый СжатиеДанных(9));
	//ТекущийОбъект.Макет = ХЗ;
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьНаФормеНаСервере()
	
	Если ЗначениеЗаполнено(Запись.ЗапросМакета) Тогда
		ЭтаФорма.Элементы.ИзменениеЗапроса.Видимость = Истина;		
		ЭтаФорма.Элементы.ОшибкаПолученияЗапроса.Видимость = Ложь;
	Иначе
		ЭтаФорма.Элементы.ИзменениеЗапроса.Видимость = Ложь;		
		ЭтаФорма.Элементы.ОшибкаПолученияЗапроса.Видимость = Истина;			
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЗаписьСервер = РеквизитФормыВЗначение("Запись");
	//ХЗ = ЗаписьСервер.Макет.Получить();
	//ТабличныйДокумент = ХЗ; 
	//
	//ВидимостьНаФормеНаСервере();
	//
	//ОбъектПриИзмененииНаСервере();

КонецПроцедуры




&НаСервере
Процедура ПараметрПриИзмененииНаСервере()
	ИмяМакета = СтрРазделить(Запись.ИмяМакета, ".")[1];
	ВыбранныйПараметрПечатнойФормы = Запись.Параметр;
	
	ПараметрыПечатныхФорм = УправлениеБТВызовСервера.ИзJSON(ЭтаФорма.ПараметрыПечатныхФормСтрока, Ложь);
	
	Для Каждого МакетПФ ИЗ ПараметрыПечатныхФорм Цикл
		Если МакетПФ.Ключ = ИмяМакета Тогда
			Для Каждого ПараметрыПФ ИЗ МакетПФ.Значение Цикл
				Если ПараметрыПФ.Ключ = ВыбранныйПараметрПечатнойФормы Тогда
					ЗначениеПараметра = ПараметрыПФ.Значение;
					
					КЧ = Новый КвалификаторыЧисла(12,2);
					КС = Новый КвалификаторыСтроки(255);
					
					Массив = Новый Массив;
					Если ТипЗнч(ЗначениеПараметра) = Тип("Строка") Тогда
						Массив.Добавить(Тип("Строка"));
						ТипК = Новый ОписаниеТипов(Массив, , КС);
					ИначеЕсли ТипЗнч(ЗначениеПараметра) = Тип("Число") Тогда
						Массив.Добавить(Тип("Число"));
						ТипК = Новый ОписаниеТипов(Массив, , ,КЧ);
					Иначе
						Массив.Добавить(ТипЗнч(ЗначениеПараметра));
						ТипК = Новый ОписаниеТипов(Массив);						
					КонецЕсли;

					ЭтаФорма.Элементы.ЗначеиеПараметра.ОграничениеТипа = ТипК;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрПриИзменении(Элемент)
	ПараметрПриИзмененииНаСервере();
КонецПроцедуры
